stephenshizl/tanker-flow-mcu/Utilities/SVD/APM32F072.svd
                <register>
                    <name>INTEN</name>
                    <displayName>INTEN</displayName>
                    <description>CAN interrupt enable register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLEEPIEN</name>
                            <description>Sleep interrupt enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUPIEN</name>
                            <description>Wakeup interrupt enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRIEN</name>
                            <description>Error interrupt enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LECIEN</name>
                            <description>Last error code interrupt enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOFFIEN</name>
                            <description>Bus-off interrupt enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRPIEN</name>
                            <description>Error passive interrupt enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRWIEN</name>
                            <description>Error warning interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRIEN1</name>
                            <description>FIFO overrun interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FFULLIEN1</name>
                            <description>FIFO full interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMPIEN1</name>
                            <description>FIFO message pending interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRIEN0</name>
                            <description>FIFO overrun interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FFULLIEN0</name>
                            <description>FIFO full interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMIEN0</name>
                            <description>FIFO message pending interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXMEIEN</name>
                            <description>Transmit mailbox empty interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ERRSTS</name>
                    <displayName>ERRSTS</displayName>
                    <description>CAN error status register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXERRCNT</name>
                            <description>Receive error counter</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXERRCNT</name>
                            <description>Transmit error counter</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LERRC</name>
                            <description>Last error code</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BOFLG</name>
                            <description>Bus-off flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRPFLG</name>
                            <description>Error passive flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRWFLG</name>
                            <description>Error warning flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BITTIM</name>
                    <displayName>BITTIM</displayName>
                    <description>CAN bit timing register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x01230000</resetValue>
                    <fields>
                        <field>
                            <name>SILMEN</name>
                            <description>Silent mode (debug)</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LBKMEN</name>
                            <description>Loop back mode (debug)</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RSYNJW</name>
                            <description>Resynchronization jump width</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TIMSEG2</name>
                            <description>Time segment 2</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIMSEG1</name>
                            <description>Time segment 1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BRPSC</name>
                            <description>Baud rate prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMID0</name>
                    <displayName>TXMID0</displayName>
                    <description>CAN TX mailbox 0 identifier register</description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STDID</name>
                            <description>Standard identifier or extended identifier</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXTID</name>
                            <description>Extended identifier</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDTYPESEL</name>
                            <description>Identifier extension</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXRFREQ</name>
                            <description>Remote transmission request</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXMREQ</name>
                            <description>Transmit mailbox request</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXDLEN0</name>
                    <displayName>TXDLEN0</displayName>
                    <description>CAN mailbox 0 data length control and time stamp register</description>
                    <addressOffset>0x184</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DLCODE</name>
                            <description>Data length code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMDL0</name>
                    <displayName>TXMDL0</displayName>
                    <description>CAN mailbox 0 data low register</description>
                    <addressOffset>0x188</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE3</name>
                            <description>Data byte 3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE2</name>
                            <description>Data byte 2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE1</name>
                            <description>Data byte 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE0</name>
                            <description>Data byte 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMDH0</name>
                    <displayName>TXMDH0</displayName>
                    <description>CAN mailbox 0 data high register</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE7</name>
                            <description>Data byte 7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE6</name>
                            <description>Data byte 6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE5</name>
                            <description>Data byte 5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE4</name>
                            <description>Data byte 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMID1</name>
                    <displayName>TXMID1</displayName>
                    <description>CAN TX mailbox 1 identifier register</description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STDID</name>
                            <description>Standard identifier or extended identifier</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXTID</name>
                            <description>Extended identifier</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDTYPESEL</name>
                            <description>Identifier extension</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXRFREQ</name>
                            <description>Remote transmission request</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXMREQ</name>
                            <description>Transmit mailbox request</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXDLEN1</name>
                    <displayName>TXDLEN1</displayName>
                    <description>CAN mailbox 1 data length control and time stamp register</description>
                    <addressOffset>0x194</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DLCODE</name>
                            <description>Data length code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMDL1</name>
                    <displayName>TXMDL1</displayName>
                    <description>CAN mailbox 1 data low register</description>
                    <addressOffset>0x198</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE3</name>
                            <description>Data byte 3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE2</name>
                            <description>Data byte 2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE1</name>
                            <description>Data byte 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE0</name>
                            <description>Data byte 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMDH1</name>
                    <displayName>TXMDH1</displayName>
                    <description>CAN mailbox 1 data high register</description>
                    <addressOffset>0x19C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE7</name>
                            <description>Data byte 7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE6</name>
                            <description>Data byte 6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE5</name>
                            <description>Data byte 5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE4</name>
                            <description>Data byte 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMID2</name>
                    <displayName>TXMID2</displayName>
                    <description>CAN TX mailbox 0 identifier register</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STDID</name>
                            <description>Standard identifier or extended identifier</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXTID</name>
                            <description>Extended identifier</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDTYPESEL</name>
                            <description>Identifier extension</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXRFREQ</name>
                            <description>Remote transmission request</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXMREQ</name>
                            <description>Transmit mailbox request</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
